Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports
The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports class interfaces all imported functions related to the toleration handler.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.DrawSnapSymbol(Tekla.Structures.Internal.dotPoint_t,System.Int32)
Exports the draw snap symbol command.
point: The point.
hitType: The type of the hit.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.SetInteractorType(System.Int32)
Exports the setting of the interactor type command.
interactorType: The interactor type to set.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.GetSnappingReferencePoint
Gets the snapping reference point, if any.
Returns: The snapping reference point, if any.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.SetSnappingReferencePoint(Tekla.Structures.Internal.dotPoint_t)
Sets the reference point for the future snapping operations.
point: The point.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.ClearSnappingReferencePoint
Clears the reference point for the future snapping operations.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.AddPickedPointToCommandContext(Tekla.Structures.Internal.dotPoint_t,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Adds the picked point into the current command's context.
point: The picked point.
isReferencePoint: A value indicating whether the point is only a reference point.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.ClearCommandContextPickedPoints
Clears the picked points in the current command's context.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.GetSnapStep(Tekla.Structures.Internal.dotPoint_t,Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotEventCameraData_t,Tekla.Structures.DirectManipulation.Adapter.Native.dotBool,System.Double@,System.Double@)
Exports the get snap step function.
cursorPoint: The cursor point.
tolerationEventData: The mouse event data struct.
isRebarSnap: Indicates if snapping is related to rebars.
outLinearSnapStep: The linear snap step.
outAngularSnapStep: The angular snap step.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.GetTolerationData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t@)
Exports the get toleration data command.
tolerationEventData: The toleration event data.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.GetHandleTolerationData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotTolerationEventData_t@)
Exports the get handle toleration data command.
tolerationEventData: The handle toleration event data.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.GetHandleCursorData(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotCursorEventData_t@)
Exports the get handle cursor data command.
cursorEventData: The cursor event.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.ConsumeTolerationEvent
Notifies when the TolerationDataChanged event has been consumed.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.RegisterToleration(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotDMTolerationTypes_t)
Exports the register toleration command.
tolerationTypes: The toleration types.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.SetNumericSnapValues(Tekla.Structures.Internal.dotPoint_t)
Sets the numeric snap values based on the point.
point: The point.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.GetNumericSnapValues(Tekla.Structures.Internal.dotPoint_t@)
Gets the numeric snap values.
point: The numeric snap values.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.ResetNumericSnapValues
Resets the numeric snap values.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.GetOrthoStatus(System.Int32@)
Exports the get ortho status.
status: The status.
Returns: Greater than 0 on success.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.ITolerationHandlerImports.SetOrtho(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Sets the orthogonal snap switch.
isEnabled: A value indicating whether to enable the orthogonal snap switch.